In [1]:
import pandas as pd
data={"name":['peter','chan','hamad'],
     "salary":[2344,6778,9087],
     "age":[12,45,90]}
pn=pd.DataFrame(data)
print(pn)

    name  salary  age
0  peter    2344   12
1   chan    6778   45
2  hamad    9087   90

In [3]:
rd=pd.read_csv("D:/class3.csv")
print(rd)

         name  english   math  physics
0       ahmad       12   23.0       23
1        amal       34   67.0       56
2       namal       56   54.0       98
3      salman       76   79.0       32
4      saleha       54   94.5       45
5      ayesha       34  110.0       98
6        anam      255  125.5      120
7       ahmad       65  141.0       65
8      nooran       98  156.5      140
9  zulqurnain       76  172.0      147

In [5]:
import pandas as pd
re=pd.read_excel("D:/red.xlsx")

print(re.head(20))

   Unnamed: 0   FIRST YEAR RESULT Unnamed: 2 Unnamed: 3 Unnamed: 4 Unnamed: 5  \
0         NaN                NAME       MATH        ENG        PHY       CHEM
1           1       AYESHA NADEEM         11         10          8          0
2           2     WAREESHA AKHTAR          5         14         12          2
3           3          EMAN QASIM          9         12          6          3
4           4             SEHRISH         19         17          7          5
5           5        NAWAL FATIMA          8         15          9          4
6           6       FATIMA SHAHID          8          8         13         10
7           7          FIZA IMRAN          5         10          3          3
8           8              BLESSY         13         17          3          4
9           9              FATIMA         11          6          8          4
10         10  AMMAMA NAVEED TURK         13          9          7          5
11         11         HADIA ABBAS         13         10         10         10
12         12       MARYAM KHALID          8         11          6          0
13         13      RIMSHA RAFIQUE          3          5          0          0
14         14         MOMINA NOOR          2         17         11          8
15         15        UROOJ KHALID         13         12          8          4
16         16        MEHAK FATIMA          7         12         10          5
17         17         NADIA BAIG           7         14          5          0
18         18        AREEBA IMRAN         11         12          6          0
19         19       SAMIA GILLANI          0         17          5          0

   Unnamed: 6 Unnamed: 7 Unnamed: 8
0         BIO      TOTAL          %
1           0         29  27.619048
2           8         41  39.047619
3           6         36  34.285714
4           5         53   50.47619
5           0         36  34.285714
6           5         44  41.904762
7           8         29  27.619048
8           8         45  42.857143
9           8         37  35.238095
10          0         34  32.380952
11          0         43  40.952381
12          6         31   29.52381
13          5         13  12.380952
14         12         50  47.619048
15          0         37  35.238095
16          4         38  36.190476
17          1         27  25.714286
18          0         29  27.619048
19          1         23  21.904762

In [7]:
print(re.tail(20))

   Unnamed: 0 FIRST YEAR RESULT Unnamed: 2 Unnamed: 3 Unnamed: 4 Unnamed: 5  \
46         46        HASNA NOOR          8          9         10         11
47         47    WANEEYA FAROOQ          9          8          8         10
48         48    AROOBA RASHEED          3          8          3          6
49         49       RIDA FATIMA         15         12         12          5
50         50        ZOYA JAMIL         20         13         13          7
51         51        FIAZA BIBI         20         18         13          4
52         52        RIMLA ABID         10         21          3          4
53         53    MANAHIL MNAWAR         10         12         10          3
54         54        MAHAK EMAN          8         14          5          1
55         55      AYESHA ZAFAR          2          8          0          2
56        NaN               NaN        NaN        NaN        NaN        NaN
57        NaN      10th  RESULT        NaN        NaN        NaN        NaN
58        NaN               NaN        NaN        NaN        NaN        NaN
59        NO.              NAME       MATH        ENG        PHY       CHEM
60          1              TUBA          4         11         10          2
61          2      MEHAR FATIMA          0         10          2          0
62          3       DUR-E-NAJAF          0          6          5          0
63          4          MANKISHA          1          3          2          0
64          5      SHANZAY KHAN          2         16          9          2
65          6      ZOHA SHABBIR         12         12          6          2

   Unnamed: 6 Unnamed: 7 Unnamed: 8
46         11         49  46.666667
47         10         45  42.857143
48          9         29  27.619048
49          0         44  41.904762
50          0         53   50.47619
51          0         55  52.380952
52          4         42         40
53          6         41  39.047619
54          8         36  34.285714
55          2         14  13.333333
56        NaN        NaN        NaN
57        NaN        NaN        NaN
58        NaN        NaN        NaN
59        BIO      TOTAL          %
60          8         35  33.333333
61          4         16  15.238095
62          5         16  15.238095
63          5         11   10.47619
64          0         29  27.619048
65          6         38  36.190476

In [9]:
print(re.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 66 entries, 0 to 65
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         62 non-null     object
 1   FIRST YEAR RESULT  64 non-null     object
 2   Unnamed: 2         63 non-null     object
 3   Unnamed: 3         63 non-null     object
 4   Unnamed: 4         63 non-null     object
 5   Unnamed: 5         63 non-null     object
 6   Unnamed: 6         63 non-null     object
 7   Unnamed: 7         63 non-null     object
 8   Unnamed: 8         63 non-null     object
dtypes: object(9)
memory usage: 4.8+ KB
None

In [11]:
print(re.describe())

        Unnamed: 0 FIRST YEAR RESULT  Unnamed: 2  Unnamed: 3  Unnamed: 4  \
count           62                64          63          63          63
unique          56                63          20          19          16
top              1              NAME           8          12           8
freq             2                 2           7           8           7

        Unnamed: 5  Unnamed: 6  Unnamed: 7  Unnamed: 8
count           63          63          63   63.000000
unique          14          13          34   34.000000
top              0           0          38   36.190476
freq            12          20           5    5.000000

In [17]:
print(re.isnull().sum())

Unnamed: 0           4
FIRST YEAR RESULT    2
Unnamed: 2           3
Unnamed: 3           3
Unnamed: 4           3
Unnamed: 5           3
Unnamed: 6           3
Unnamed: 7           3
Unnamed: 8           3
dtype: int64

In [19]:
import pandas as pd
rd=pd.read_csv("D:/class3.csv")
print(rd)

         name  english   math  physics
0       ahmad       12   23.0       23
1        amal       34   67.0       56
2       namal       56   54.0       98
3      salman       76   79.0       32
4      saleha       54   94.5       45
5      ayesha       34  110.0       98
6        anam      255  125.5      120
7       ahmad       65  141.0       65
8      nooran       98  156.5      140
9  zulqurnain       76  172.0      147

In [27]:
print(rd["english"].duplicated().sum())

2

In [29]:
print(rd.drop_duplicates("name"))

         name  english   math  physics
0       ahmad       12   23.0       23
1        amal       34   67.0       56
2       namal       56   54.0       98
3      salman       76   79.0       32
4      saleha       54   94.5       45
5      ayesha       34  110.0       98
6        anam      255  125.5      120
8      nooran       98  156.5      140
9  zulqurnain       76  172.0      147

In [59]:
import pandas as pd
rd=pd.read_csv("D:/class3.csv")
print(rd)

          name  english   math  physics
0        ahmad      NaN   23.0     23.0
1         amal     34.0   67.0     56.0
2        namal     56.0   54.0      NaN
3       salman     76.0   79.0     32.0
4       saleha     54.0   94.5     45.0
5       ayesha     34.0  110.0     98.0
6         anam    255.0  125.5    120.0
7        ahmad     65.0  141.0     65.0
8       nooran     98.0  156.5    140.0
9   zulqurnain     76.0  172.0    147.0
10     areesha     34.0    NaN    123.0

In [43]:
print(rd.isnull().sum())

name       0
english    1
math       1
physics    1
dtype: int64

In [63]:
import numpy as np
rd["english"]=rd["english"].replace(np.nan,78)
print(rd["english"])
print(rd["english"].mean())

0      78.0
1      34.0
2      56.0
3      76.0
4      54.0
5      34.0
6     255.0
7      65.0
8      98.0
9      76.0
10     34.0
Name: english, dtype: float64
78.18181818181819

In [67]:
print(rd)
print(rd.fillna(method="ffill"))

          name  english   math  physics
0        ahmad     78.0   23.0     23.0
1         amal     34.0   67.0     56.0
2        namal     56.0   54.0      NaN
3       salman     76.0   79.0     32.0
4       saleha     54.0   94.5     45.0
5       ayesha     34.0  110.0     98.0
6         anam    255.0  125.5    120.0
7        ahmad     65.0  141.0     65.0
8       nooran     98.0  156.5    140.0
9   zulqurnain     76.0  172.0    147.0
10     areesha     34.0    NaN    123.0
          name  english   math  physics
0        ahmad     78.0   23.0     23.0
1         amal     34.0   67.0     56.0
2        namal     56.0   54.0     56.0
3       salman     76.0   79.0     32.0
4       saleha     54.0   94.5     45.0
5       ayesha     34.0  110.0     98.0
6         anam    255.0  125.5    120.0
7        ahmad     65.0  141.0     65.0
8       nooran     98.0  156.5    140.0
9   zulqurnain     76.0  172.0    147.0
10     areesha     34.0  172.0    123.0

C:\Users\Fizza Tehreem\AppData\Local\Temp\ipykernel_10184\3711813678.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(rd.fillna(method="ffill"))

In [5]:
import pandas as pd
rd=pd.read_csv("D:/class3.csv")
rd.loc[(rd["english"]>50),"status"]="high marks"
rd.loc[(rd["english"]>100,"status")]="highest"
print(rd)

          name  english   math  physics      status
0        ahmad      NaN   23.0     23.0         NaN
1         amal     34.0   67.0     56.0         NaN
2        namal     56.0   54.0      NaN  high marks
3       salman     76.0   79.0     32.0  high marks
4       saleha     54.0   94.5     45.0  high marks
5       ayesha     34.0  110.0     98.0         NaN
6         anam    255.0  125.5    120.0     highest
7        ahmad     65.0  141.0     65.0  high marks
8       nooran     98.0  156.5    140.0  high marks
9   zulqurnain     76.0  172.0    147.0  high marks
10     areesha     34.0    NaN    123.0         NaN

In [7]:
rd["total"]=rd["math"]+rd["physics"]
print(rd)

          name  english   math  physics      status  total
0        ahmad      NaN   23.0     23.0         NaN   46.0
1         amal     34.0   67.0     56.0         NaN  123.0
2        namal     56.0   54.0      NaN  high marks    NaN
3       salman     76.0   79.0     32.0  high marks  111.0
4       saleha     54.0   94.5     45.0  high marks  139.5
5       ayesha     34.0  110.0     98.0         NaN  208.0
6         anam    255.0  125.5    120.0     highest  245.5
7        ahmad     65.0  141.0     65.0  high marks  206.0
8       nooran     98.0  156.5    140.0  high marks  296.5
9   zulqurnain     76.0  172.0    147.0  high marks  319.0
10     areesha     34.0    NaN    123.0         NaN    NaN

In [13]:
import pandas as pd
rd=pd.read_csv("D:/class3.csv")
print(rd)
rd["half"]=(rd["english"]+rd["math"]+rd["physics"])/2
print(rd)

          name  english   math  physics
0        ahmad      NaN   23.0     23.0
1         amal     34.0   67.0     56.0
2        namal     56.0   54.0      NaN
3       salman     76.0   79.0     32.0
4       saleha     54.0   94.5     45.0
5       ayesha     34.0  110.0     98.0
6         anam    255.0  125.5    120.0
7        ahmad     65.0  141.0     65.0
8       nooran     98.0  156.5    140.0
9   zulqurnain     76.0  172.0    147.0
10     areesha     34.0    NaN    123.0
          name  english   math  physics    half
0        ahmad      NaN   23.0     23.0     NaN
1         amal     34.0   67.0     56.0   78.50
2        namal     56.0   54.0      NaN     NaN
3       salman     76.0   79.0     32.0   93.50
4       saleha     54.0   94.5     45.0   96.75
5       ayesha     34.0  110.0     98.0  121.00
6         anam    255.0  125.5    120.0  250.25
7        ahmad     65.0  141.0     65.0  135.50
8       nooran     98.0  156.5    140.0  197.25
9   zulqurnain     76.0  172.0    147.0  197.50
10     areesha     34.0    NaN    123.0     NaN

In [9]:
#data={"months":["january","february","march"]}
#print(pd.DataFrame(data))
import pandas as pd
data={"months":["january","february","march"]}
print(pd.DataFrame(data))

     months
0   january
1  february
2     march

In [3]:
import pandas as pd
data={"months":["january","february","march","april"]}
a=pd.DataFrame(data)
print(a)
def extract(value):
    return value[0:3]
a["short"]=a["months"].map(extract)
print(a)

     months
0   january
1  february
2     march
3     april
     months short
0   january   jan
1  february   feb
2     march   mar
3     april   apr

In [11]:
import pandas as pd
re=pd.read_excel("D:/red.xlsx")
print(re)

   Unnamed: 0 FIRST YEAR RESULT Unnamed: 2 Unnamed: 3 Unnamed: 4 Unnamed: 5  \
0         NaN              NAME       MATH        ENG        PHY       CHEM
1           1     AYESHA NADEEM         11         10          8          0
2           2   WAREESHA AKHTAR          5         14         12          2
3           3        EMAN QASIM          9         12          6          3
4           4           SEHRISH         19         17          7          5
..        ...               ...        ...        ...        ...        ...
61          2      MEHAR FATIMA          0         10          2          0
62          3       DUR-E-NAJAF          0          6          5          0
63          4          MANKISHA          1          3          2          0
64          5      SHANZAY KHAN          2         16          9          2
65          6      ZOHA SHABBIR         12         12          6          2

   Unnamed: 6 Unnamed: 7 Unnamed: 8
0         BIO      TOTAL          %
1           0         29  27.619048
2           8         41  39.047619
3           6         36  34.285714
4           5         53   50.47619
..        ...        ...        ...
61          4         16  15.238095
62          5         16  15.238095
63          5         11   10.47619
64          0         29  27.619048
65          6         38  36.190476

[66 rows x 9 columns]

In [3]:
import pandas as pd
data=pd.read_csv("D:/employe.csv")
print(data)

    empid      name        salary  bonus      country gender
0       1   aleesha   2300.000000      1     pakistan      F
1       2    areeba   3456.000000      2  afghanistan      M
2       3      hina   4563.000000      3      america      F
3       4    majeed   6785.000000      5       turkey      M
4       5   minahil   2345.000000      7    tajikstan      M
5       6      mala   9876.000000      8     pakistan      M
6       7     moeez   8564.400000      1  afghanistan      F
7       8     ahmad   9614.942857      2      america      M
8       9    zubair  10665.485710      3       turkey      M
9      10     talal  11716.028570      4    tajikstan      F
10     11  iftikhar  12766.571430      5     pakistan      F
11     12    moneeb  13817.114290      3  afghanistan      M
12     13     hamid  14867.657140      4      america      F
13     14     fizza  15918.200000      2       turkey      M
14     15    salman  16968.742860      5    tajikstan      M

In [7]:
gp=data.groupby(["country","gender"]).agg({"salary":"mean"})
print(gp)

                          salary
country     gender
afghanistan F        8564.400000
            M        8636.557145
america     F        9715.328570
            M        9614.942857
pakistan    F        7533.285715
            M        9876.000000
tajikstan   F       11716.028570
            M        9656.871430
turkey      M       11122.895237

In [9]:
import pandas as pd
data1={"emp id":[1,2,3,4,5,6,7,8],
     "name":["aslam","gulfam","hurry","numair","ahmad","jafar","ayesha","ishaq"],
     "age":[23,24,45,65,72,37,65,43]}
data2={"emp id":[1,2,3,4,5,6,7,8],
      "salary":[12000,34000,76000,34000,54600,23000,12000,98000]}
d1=pd.DataFrame(data1)
d2=pd.DataFrame(data2)
print(d1)
print(" ")
print(d2)
print(pd.merge(d1,d2,on="emp id"))

   emp id    name  age
0       1   aslam   23
1       2  gulfam   24
2       3   hurry   45
3       4  numair   65
4       5   ahmad   72
5       6   jafar   37
6       7  ayesha   65
7       8   ishaq   43

   emp id  salary
0       1   12000
1       2   34000
2       3   76000
3       4   34000
4       5   54600
5       6   23000
6       7   12000
7       8   98000
   emp id    name  age  salary
0       1   aslam   23   12000
1       2  gulfam   24   34000
2       3   hurry   45   76000
3       4  numair   65   34000
4       5   ahmad   72   54600
5       6   jafar   37   23000
6       7  ayesha   65   12000
7       8   ishaq   43   98000

In [7]:
import pandas as pd
dict={"fruits":["banana","apple","orange"],
     "price":[100,400,600],
     "quantity":[23,15,14]}
df1=pd.DataFrame(dict)
print(df1)

df2=df1.copy()

df2.loc[0,"price"]=130
df2.loc[1,"price"]=180
df2.loc[2,"price"]=200
print(df2)
print(  )
print(df1.compare(df2))

   fruits  price  quantity
0  banana    100        23
1   apple    400        15
2  orange    600        14
   fruits  price  quantity
0  banana    130        23
1   apple    180        15
2  orange    200        14

  price
   self other
0   100   130
1   400   180
2   600   200

In [19]:
import pandas as pd
dict={"keys":["k1","k2","k2","k3","k1","k3","k1"],
     "names":["ahmad","bilial","imran","shah","aman","shardha","fatima"],
     "houses":["red","green","blue","red","blue","red","orange"]}
df=pd.DataFrame(dict)
print(df)
print()
print(pd.melt(df,id_vars=["names"],value_vars=["houses"] ,var_name="houses",value_name="colors"))

  keys    names  houses
0   k1    ahmad     red
1   k2   bilial   green
2   k2    imran    blue
3   k3     shah     red
4   k1     aman    blue
5   k3  shardha     red
6   k1   fatima  orange

     names  houses  colors
0    ahmad  houses     red
1   bilial  houses   green
2    imran  houses    blue
3     shah  houses     red
4     aman  houses    blue
5  shardha  houses     red
6   fatima  houses  orange